<template>
  <div class="product-description">
    <p>
      迭代不验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品验证产品
    </p>

  </div>
</template>

<script>

export default {
  components: { },
  data() {
    return {
      activeName: 'first'
    }
  },
  methods: {

  }
}
</script>

<style lang="less" scoped>
  .product-description {

  }
</style>
